[
    {
        "id": 1,
        "label": "Luterra Castle",
        "seeds": 10,
        "type": "City",
        "map": "luterraCastle.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first 3 Mokoko Seeds are in Luterra Palace through the door and into nothingness. The first one should be just a little bit after the door."
            },
            {
                "id": 2,
                "description": "Continuing on, the second one can be found just a little bit further up."
            },
            {
                "id": 3,
                "description": "Then, the third seed can be found further up from the last."
            },
            {
                "id": 4,
                "description": "There are two seeds in the walls of Kadan Cathedral. Go into this building and to the end towards the left is a little nook. Go to the right wall and you can go through it. As the floor is also nothingness, if you click towards the seeds, you will follow along the path to get there. The first one shouldn't be too far."
            },
            {
                "id": 5,
                "description": "Continuing on, step back a little then keep going up and take a right to get to the second seed."
            },
            {
                "id": 6,
                "description": "Go through the door into the Kaden Cathedral Basement. Go all the way to the end of the map and on the far right side sits a Mokoko Seed hidden behind the corner of the wall."
            },
            {
                "id": 7,
                "description": "This Mokoko Seed is located in the stands full of cheering people towards the bottom."
            },
            {
                "id": 8,
                "description": "This seed is located in the outside seating area of Neria's Tavern. Go to the very end against the brick wall behind the table towards the right."
            },
            {
                "id": 9,
                "description": "You can find this Mokoko Seed next to the fruit stand on the side facing you."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed can be found in the corner of the bridge arch on the left side of the path."
            }
        ]
    },
    {
        "id": 2,
        "label": "Dyorika Plain",
        "seeds": 11,
        "type": "Field",
        "map": "dyorikaPlain.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found in a bush, up against a wooden fence. It will be on the left side of the path to the right of the sign."
            },
            {
                "id": 2,
                "description": "This one is located on the ground in front of a wooden fence near where the flying insects are."
            },
            {
                "id": 3,
                "description": "This seed is in the left corner of the Plain Crow stables. The corner of where a wood fence meets with a stone wall,"
            },
            {
                "id": 4,
                "description": "This seed can be found in the horse stables behind the wooden gate."
            },
            {
                "id": 5,
                "description": "This one is located in some trees to the right of the path near some water."
            },
            {
                "id": 6,
                "description": "This Mokoko Seed can be found in a patch of grass behind a broken down wooden caravan and to the left of the hay."
            },
            {
                "id": 7,
                "description": "This seed is on the ground in front of a pile of hay."
            },
            {
                "id": 8,
                "description": "This one is on the ground in front of some wooden crates with a couple sacks of fruit to the left of it."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed can be located after killing King Pigerett to the left side of the hut in the back."
            },
            {
                "id": 10,
                "description": "This seed is on the ground out in the open near some sowed soil and a wooden fence."
            },
            {
                "id": 11,
                "description": "The last Mokoko Seed is in the very top of the map, to the left of the railroad tracks."
            }
        ]
    },
    {
        "id": 3,
        "label": "Sunbright Hill",
        "seeds": 10,
        "type": "Field",
        "map": "sunbrightHill.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is to the right of the path, next to a wooden fence and a pack of wolves."
            },
            {
                "id": 2,
                "description": "This seed can be found within a bush to the right of the path."
            },
            {
                "id": 3,
                "description": "This Mokoko Seed can be found in a pumpkin patch, on the ground in front of a scarecrow with a pumpkin as its head."
            },
            {
                "id": 4,
                "description": "This seed can be found in a pumpkin patch as well. This patch is near the water, but the seed is on the other end next to the path."
            },
            {
                "id": 5,
                "description": "This Mokoko Seed can be found in a patch of sunflowers."
            },
            {
                "id": 6,
                "description": "This one can be located past the Potion Merchant, then behind the wooden shed."
            },
            {
                "id": 7,
                "description": "This seed can be found on the ground near a wooden fence. It will be close to enemies called World Harvest Members."
            },
            {
                "id": 8,
                "description": "This Mokoko Seed can be found in a big patch of sunflowers, near a rock cliff and wooden log fencing."
            },
            {
                "id": 9,
                "description": "You can find this seed in a tightly knit pumpkin patch that will be in front of a wooden cage."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed can be found next to a boulder to the right of the overgrown stone structures, in the corner of a stone path."
            }
        ]
    },
    {
        "id": 4,
        "label": "Lastra Forest/King's Tomb",
        "seeds": 7,
        "type": "Dungeon",
        "map": "luterraForest.png",
        "instructions": [
            {
                "id": 1,
                "description": "You can find the first Mokoko Seed to the left of the path and to the right of the ceremonial altar. You will see it on the ground in plain sight."
            },
            {
                "id": 2,
                "description": "This seed can be found right after you open the door with the Sword Seal. You will see it to the right past the iron fence."
            },
            {
                "id": 3,
                "description": "Go across the wooden bridge to the right. Keep going till you see the next Mokoko Seed to the top of the path near some candles."
            },
            {
                "id": 4,
                "description": "Keep going forward, you will find another Mokoko Seed to the left of the path lit up by some candles."
            },
            {
                "id": 5,
                "description": "Then, go across the wooden bridge ahead, you will see yet another Mokoko Seed to the right next to some tombstones."
            },
            {
                "id": 6,
                "description": "This seed is can be found straight ahead through the tombstones, you will see it on the ground."
            },
            {
                "id": 7,
                "description": "This Mokoko Seed is the last one in Luterra Forest and can be found next to the dead tree when you land on this platform. The next 3 Mokoko Seeds are in King's Tomb through the door."
            },
            {
                "id": 8,
                "description": "You can find this seed right as you spawn in to the Tome of the Great King Luterra. It will be to the left of the path hidden in a patch of grass to the right of the burning torch."
            },
            {
                "id": 9,
                "description": "Once at top of the staircase, to the left you will see another Mokoko Seed on the ledge."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed is hidden in a vase at the very end of this path. You have to destroy the pot by attacking it, then you should see the seed."
            }
        ]
    },
    {
        "id": 5,
        "label": "Flowering Orchard",
        "seeds": 10,
        "type": "Field",
        "map": "floweringOrchard.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found to the left of the path hidden in a bush against a wooden fence."
            },
            {
                "id": 2,
                "description": "This seed is located in the orchard in front of tree."
            },
            {
                "id": 3,
                "description": "This one can be found right outside of Sien Inn to the right of the path under a tree."
            },
            {
                "id": 4,
                "description": "This Mokoko seed can be found at the end of this path on the ground between a tree and a bush."
            },
            {
                "id": 5,
                "description": "This seed is located to the right of the path and you will see a house in the hillside with its door open. Go down and you can go in. Then you will see some barrels to the left, destroy them to get to the Mokoko Seed."
            },
            {
                "id": 6,
                "description": "This seed can be found in a basket in front of a tree. You will have to kill some enemies before you can get it."
            },
            {
                "id": 7,
                "description": "You can find this Mokoko Seed at the end of the path under a large tree."
            },
            {
                "id": 8,
                "description": "This one is located on the wooden platform to the left, under the tent with a white cloth tarp."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed can be found next to a burnt down house."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed can be found to the right of the dead tree. Near where you fight the clown boss."
            }
        ]
    },
    {
        "id": 6,
        "label": "Blackrose Chapel",
        "seeds": 13,
        "type": "Field",
        "map": "blackroseChapel.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found to the right of the path and in front of a burning blazer."
            },
            {
                "id": 2,
                "description": "You will see a lantern on a chair next to a closed door, you can go in. When you are in, you can find one seed to the left near the wooden box in the corner. See next instruction for second seed in this location."
            },
            {
                "id": 3,
                "description": "The second seed can be found to the left side of the bookcase."
            },
            {
                "id": 4,
                "description": "This Mokoko Seed can be found on the ground in front of a statue of a man holding a staff."
            },
            {
                "id": 5,
                "description": "Go to the end of the path and you will see a destroyed barn, go in it. You will find 3 Mokoko Seeds at this location. The first seed will be at the end of the hall."
            },
            {
                "id": 6,
                "description": "Continue on the path and once you come to where it splits, take a left and at the end should be the second seed."
            },
            {
                "id": 7,
                "description": "Go back and take the other path. Take an immediate right after the wooden fence and at the end you will see the third seed."
            },
            {
                "id": 8,
                "description": "This seed can be found in the Church Graveyard, against the fencing in a corner."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed can be found to the other end of the building against the wall. Across from where the Triport is."
            },
            {
                "id": 10,
                "description": "This seed is hidden in some grass in front of the water fountain."
            },
            {
                "id": 11,
                "description": "This seed can be found next to the first ritual you come across against the wall."
            },
            {
                "id": 12,
                "description": "This seed is behind the stone altar."
            },
            {
                "id": 13,
                "description": "The last Mokoko Seed can be found after climbing up a few stone cliffs. It will be on the ground to the right of the path near candles and tombstones."
            }
        ]
    },
    {
        "id": 7,
        "label": "Blackrose Basement",
        "seeds": 8,
        "type": "Dungeon",
        "map": "blackroseBasement.png",
        "note": "Do not kill the NPCs, Heretic Devotees. Make sure to do a full sweep of the dungeon and kill all Heretic enemies.",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found to the right of the path up the stairs and on the ground near the desks."
            },
            {
                "id": 2,
                "description": "The next seed is located in a room where you go for the dungeon quest to the right next to the burning blazer."
            },
            {
                "id": 3,
                "description": "Go through the door to the left and you will find 3 seeds here. One seed is immediately to the left in the corner."
            },
            {
                "id": 4,
                "description": "The second seed is to the far right corner that is lit up by the torch."
            },
            {
                "id": 5,
                "description": "You will find this seed next to the last one, lit up by the torch."
            },
            {
                "id": 6,
                "description": "If you have followed the Note, after killing the 14 Heretics, you should see this door open. Right inside you can see two Mokoko Seeds on the ground."
            },
            {
                "id": 7,
                "description": "See 6."
            },
            {
                "id": 8,
                "description": "The last Mokoko Seed can be found to the right and behind the railing to the end. You will see the seed on the ground in the corner."
            }
        ]
    },
    {
        "id": 8,
        "label": "Leyar Terrace",
        "seeds": 8,
        "type": "Field",
        "map": "leyarTerrace.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is immediately to your left as you enter Leyar Terrace from Blackrose Chapel."
            },
            {
                "id": 2,
                "description": "This seed can be found in the corner of the path here under the trees."
            },
            {
                "id": 3,
                "description": "You can find this Mokoko Seed under the waterfall."
            },
            {
                "id": 4,
                "description": "This seed can be located on the ground in front of a big tree and also to the right of a few floating blue orbs."
            },
            {
                "id": 5,
                "description": "This seed is hidden in a secret area. Go to the corner left of where you got the previous seed. You will see a path leading up a hill. Go up it and take a right and follow all the way up. You will see a Vista, it is in a bush North of it and to the left of the tree."
            },
            {
                "id": 6,
                "description": "This seed is located at the very end of this path, under a rock ledge with a dead tree on top of it."
            },
            {
                "id": 7,
                "description": "You can find this seed to the right of the path near a wooden fence. There is hay on the other side of the fence."
            },
            {
                "id": 8,
                "description": "The last Mokoko Seed can be found on a rocky ledge that is in the water."
            }
        ]
    },
    {
        "id": 9,
        "label": "Borea's Domain",
        "seeds": 11,
        "type": "Field",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found near a wooden watchtower and a wagon holding crates and sacks."
            },
            {
                "id": 2,
                "description": "You can find this seed at the end of this path next to a wagon in the corner."
            },
            {
                "id": 3,
                "description": "This seed is hidden in a bush to the left of the tent."
            },
            {
                "id": 4,
                "description": "This seed is at the very end here, you will need to kill a mob to get to the edge. You will then see the seed on the ledge surrounded by flames"
            },
            {
                "id": 5,
                "description": "This Mokoko Seed can be found near the demon hut on the left. You will have to kill the group of enemies there before you can get to it."
            },
            {
                "id": 6,
                "description": "This Mokoko Seed can be found near a boulder, left of the dead tree. You may see a waterfall off the edge, its to the right of it."
            },
            {
                "id": 7,
                "description": "You can find this seed in some grass in front of the wooden watch tower."
            },
            {
                "id": 8,
                "description": "This Mokoko Seed can be found hidden in some grass between a wooden spiked fence and a demonic looking wagon."
            },
            {
                "id": 9,
                "description": "This seed is located at the very end of the path under a large tree after the Vista."
            },
            {
                "id": 10,
                "description": "There will be two Mokoko Seeds here. You need to play the Forest's Minute song to open the secret passage way."
            },
            {
                "id": 11,
                "description": "Refer to #10."
            }
        ]
    },
    {
        "id": 10,
        "label": "Croconys Seashore",
        "seeds": 18,
        "type": "Field",
        "map": "croconysSeashore.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found on the left side of the dock and water wheel. Hidden under the deck."
            },
            {
                "id": 2,
                "description": "This seed is located in a nook in the left corner between some barrels. There will be a group of pirates you will have to kill first."
            },
            {
                "id": 3,
                "description": "You can find this Mokoko Seed hidden in some grass on the beach. You may need to kill some crabs to get it."
            },
            {
                "id": 4,
                "description": "This seed is located in the palm trees. Enter behind them from the left side."
            },
            {
                "id": 5,
                "description": "This Mokoko Seed is under the big tree to the left of the path, near the cliff edge. You may have to kill a group of Azure Powder Moths to access it."
            },
            {
                "id": 6,
                "description": "You can find this seed in Lightshade Inn, to the left after the entrance in the corner. It will be near a barrel of fish."
            },
            {
                "id": 7,
                "description": "This Mokoko Seed is on the ground against the rock wall behind the large skull."
            },
            {
                "id": 8,
                "description": "This seed can be found hidden in a bush at the end of the path. You may have to fight a group of pirates to get to it."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed is up on the deck to the right."
            },
            {
                "id": 10,
                "description": "These two Mokoko Seeds will take some time to get. At the end here, you will see a barricade that blocks a bridge. It will take you 5-10 mins to break it. Once broken quickly go through as it will respawn immediately. The first seed is straight ahead over the bridge to the end of the path. The second seed can be accessed taking either of the two remaining paths and you should eventually come up on it."
            },
            {
                "id": 11,
                "description": "See #10."
            },
            {
                "id": 12,
                "description": "You can find two more Mokoko Seeds by climbing up the vines on the side of the cliff. You will find the first seed near the wooden tower to the right hidden in some grass. The second seed is further to the right near the spiked wooden fence."
            },
            {
                "id": 13,
                "description": "See #12."
            },
            {
                "id": 14,
                "description": "This Mokoko Seed is located hidden near a bush in front of a giant tree."
            },
            {
                "id": 15,
                "description": "This seed is located in some overgrowth on top the ship."
            },
            {
                "id": 16,
                "description": "You can find this Mokoko Seed on a wooden platform you can jump to, hidden in some overgrowth plants."
            },
            {
                "id": 17,
                "description": "From the last seed, if you continue forward to the very end you will come up on another seed. It is sitting next to a chest."
            },
            {
                "id": 18,
                "description": "The last Mokoko Seed can be found on the shore near a broken wooden row boat."
            }
        ]
    },
    {
        "id": 11,
        "label": "Wavestrand Port",
        "seeds": 6,
        "type": "Town",
        "map": "wavestrandPort.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found right as you enter Wavestrand Port from Borea's Domanin. It is hidden in some grass near some fish in a barrel and a hanging net full of fish."
            },
            {
                "id": 2,
                "description": "This seed can be found to the right of the Potion Merchant's stand."
            },
            {
                "id": 3,
                "description": "This Mokoko Seed can be found hidden in a bush between a table with an umbrella and a stone fence."
            },
            {
                "id": 4,
                "description": "This seed is located behind the water fountain."
            },
            {
                "id": 5,
                "description": "This seed is near a robot to the right of the Gear Merchant stand."
            },
            {
                "id": 6,
                "description": "The last Mokoko Seed can be found at the back of the wooden caravan thats holding fish and other goods."
            }
        ]
    },
    {
        "id": 12,
        "label": "Stormcry Grotto",
        "seeds": 12,
        "type": "Dungeon",
        "note": "You have to kill all bats and slimes in the dungeon to access the 3 Mokoko Seeds in the middle of the map.",
        "map": "stormcryGrotto.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is located at the end of the wooden ledge, near the telescope."
            },
            {
                "id": 2,
                "description": "You can find this Mokoko Seed at the end of the path to the right near some gold and chests."
            },
            {
                "id": 3,
                "description": "There are two Mokoko Seeds at this location. In this little nook, you will see some sort of cave entrance. Once you go through it, you will see one seed on the ground in front of the tent. The second seed is directly across from the last under the waterfall."
            },
            {
                "id": 4,
                "description": "See #3."
            },
            {
                "id": 5,
                "description": "This Mokoko Seed can be found at the very end of this path on the wooden dock. Make sure you get this seed before continuing as you will not be able to go back to get it without doing the dungeon again."
            },
            {
                "id": 6,
                "description": "You can find this seed at the end of this path to the right. You will see it to the right of the table."
            },
            {
                "id": 7,
                "description": "You can find 2 Mokoko Seeds at this location. To the left of the path you should be able to jump down. Go to the end on to the ship and you should see the two seeds."
            },
            {
                "id": 8,
                "description": "See #7."
            },
            {
                "id": 9,
                "description": "This seed is located at the end of the path."
            },
            {
                "id": 10,
                "description": "There are 3 seeds at this location. To open the passage way, you need to kill all bats and slimes in the dungeon. Before you climb up the wooden tower to the boss, go back to the middle of the map. All the gold and riches should be gone so you can go through. Keep going straight till you hit a large room. The last 3 Mokoko Seeds are in this room."
            },
            {
                "id": 11,
                "description": "See #10."
            },
            {
                "id": 12,
                "description": "See #10."
            }
        ]
    }
]