[
    {
        "id": 1,
        "label": "Luterra Castle",
        "seeds": 10,
        "type": "City",
        "map": "luterraCastle.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first 3 Mokoko Seeds are in Luterra Palace through the door and into nothingness. The first one should be just a little bit after the door."
            },
            {
                "id": 2,
                "description": "Continuing on, the second one can be found just a little bit further up."
            },
            {
                "id": 3,
                "description": "Then, the third seed can be found further up from the last."
            },
            {
                "id": 4,
                "description": "There are two seeds in the walls of Kadan Cathedral. Go into this building and to the end towards the left is a little nook. Go to the right wall and you can go through it. As the floor is also nothingness, if you click towards the seeds, you will follow along the path to get there. The first one shouldn't be too far."
            },
            {
                "id": 5,
                "description": "Continuing on, step back a little then keep going up and take a right to get to the second seed."
            },
            {
                "id": 6,
                "description": "Go through the door into the Kaden Cathedral Basement. Go all the way to the end of the map and on the far right side sits a Mokoko Seed hidden behind the corner of the wall."
            },
            {
                "id": 7,
                "description": "This Mokoko Seed is located in the stands full of cheering people towards the bottom."
            },
            {
                "id": 8,
                "description": "This seed is located in the outside seating area of Neria's Tavern. Go to the very end against the brick wall behind the table towards the right."
            },
            {
                "id": 9,
                "description": "You can find this Mokoko Seed next to the fruit stand on the side facing you."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed can be found in the corner of the bridge arch on the left side of the path."
            }
        ]
    },
    {
        "id": 2,
        "label": "Dyorika Plain",
        "seeds": 11,
        "type": "Region",
        "map": "dyorikaPlain.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed can be found in a bush, up against a wooden fence. It will be on the left side of the path to the right of the sign."
            },
            {
                "id": 2,
                "description": "This one is located on the ground in front of a wooden fence near where the flying insects are."
            },
            {
                "id": 3,
                "description": "This seed is in the left corner of the Plain Crow stables. The corner of where a wood fence meets with a stone wall,"
            },
            {
                "id": 4,
                "description": "This seed can be found in the horse stables behind the wooden gate."
            },
            {
                "id": 5,
                "description": "This one is located in some trees to the right of the path near some water."
            },
            {
                "id": 6,
                "description": "This Mokoko Seed can be found in a patch of grass behind a broken down wooden caravan and to the left of the hay."
            },
            {
                "id": 7,
                "description": "This seed is on the ground in front of a pile of hay."
            },
            {
                "id": 8,
                "description": "This one is on the ground in front of some wooden crates with a couple sacks of fruit to the left of it."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed can be located after killing King Pigerett to the left side of the hut in the back."
            },
            {
                "id": 10,
                "description": "This seed is on the ground out in the open near some sowed soil and a wooden fence."
            },
            {
                "id": 11,
                "description": "The last Mokoko Seed is in the very top of the map, to the left of the railroad tracks."
            }
        ]
    },
    {
        "id": 3,
        "label": "Sunbright Hill",
        "seeds": 10,
        "type": "Region",
        "map": "sunbrightHill.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is to the right of the path, next to a wooden fence and a pack of wolves."
            },
            {
                "id": 2,
                "description": "This seed can be found within a bush to the right of the path."
            },
            {
                "id": 3,
                "description": "This Mokoko Seed can be found in a pumpkin patch, on the ground in front of a scarecrow with a pumpkin as its head."
            },
            {
                "id": 4,
                "description": "This seed can be found in a pumpkin patch as well. This patch is near the water, but the seed is on the other end next to the path."
            },
            {
                "id": 5,
                "description": "This Mokoko Seed can be found in a patch of sunflowers."
            },
            {
                "id": 6,
                "description": "This one can be located past the Potion Merchant, then behind the wooden shed."
            },
            {
                "id": 7,
                "description": "This seed can be found on the ground near a wooden fence. It will be close to enemies called World Harvest Members."
            },
            {
                "id": 8,
                "description": "This Mokoko Seed can be found in a big patch of sunflowers, near a rock cliff and wooden log fencing."
            },
            {
                "id": 9,
                "description": "You can find this seed in a tightly knit pumpkin patch that will be in front of a wooden cage."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed can be found next to a boulder to the right of the overgrown stone structures, in the corner of a stone path."
            }
        ]
    },
    {
        "id": 4,
        "label": "Lastra Forest",
        "seeds": 7,
        "type": "Dungeon",
        "map": "luterraForest.png",
        "instructions": [
            {
                "id": 1,
                "description": "You can find the first Mokoko Seed to the left of the path and to the right of the ceremonial altar. You will see it on the ground in plain sight."
            },
            {
                "id": 2,
                "description": "This seed can be found right after you open the door with the Sword Seal. You will see it to the right past the iron fence."
            },
            {
                "id": 3,
                "description": "Go across the wooden bridge to the right. Keep going till you see the next Mokoko Seed to the top of the path near some candles."
            },
            {
                "id": 4,
                "description": "Keep going forward, you will find another Mokoko Seed to the left of the path lit up by some candles."
            },
            {
                "id": 5,
                "description": "Then, go across the wooden bridge ahead, you will see yet another Mokoko Seed to the right next to some tombstones."
            },
            {
                "id": 6,
                "description": "This seed is can be found straight ahead through the tombstones, you will see it on the ground."
            },
            {
                "id": 7,
                "description": "This Mokoko Seed can be found next to the dead tree when you land on this platform."
            },
            {
                "id": 8,
                "description": "You can find this seed right as you spawn in to the Tome of the Great King Luterra. It will be to the left of the path hidden in a patch of grass to the right of the burning torch."
            },
            {
                "id": 9,
                "description": "Once at top of the staircase, to the left you will see another Mokoko Seed on the ledge."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed is hidden in a vase at the very end of this path. You have to destroy the pot by attacking it, then you should see the seed."
            }
        ]
    },
    {
        "id": 5,
        "label": "King's Tomb",
        "seeds": 3,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 6,
        "label": "Flowering Orchard",
        "seeds": 10,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 7,
        "label": "Blackrose Chapel",
        "seeds": 13,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 8,
        "label": "Leyar Terrace",
        "seeds": 8,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 9,
        "label": "Borea's Domain",
        "seeds": 11,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 10,
        "label": "Croconys Seashore",
        "seeds": 18,
        "type": "Region",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 11,
        "label": "Wavestrand Port",
        "seeds": 6,
        "type": "Town",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    },
    {
        "id": 12,
        "label": "Stormcry Grotto",
        "seeds": 12,
        "type": "Dungeon",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            },
            {
                "id": 2,
                "description": "This Mokoko seed is in a patch of grass near the path."
            }
        ]
    }
]