[
    {
        "id": 1,
        "label": "Prideholme",
        "seeds": 9,
        "type": "Town",
        "map": "prideholm.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is located behind a planted tree on the right side of the staircase closest to the Triport."
            },
            {
                "id": 2,
                "description": "The next Mokoko Seed is near the big lion statue towards the middle of the map."
            },
            {
                "id": 3,
                "description": "This seed is located on the left side of the Plaza Bulletin Board."
            },
            {
                "id": 4,
                "description": "This Mokoko Seed is located on the ground in front of the huge tree. It is to the right of Prideholm Cathedral."
            },
            {
                "id": 5,
                "description": "Go to the Prideholm Cathedral in the very left end of the building and you should be able to walk right through the wall. The path is literally off the map into nothingness. Once through the wall, take a right, then go left and you should come up on the seed."
            },
            {
                "id": 6,
                "description": "This seed is also in the walls of Prideholm Cathedral right next to seed number 5, the previous seed."
            },
            {
                "id": 7,
                "description": "This seed is located on the right side of the house behind Traveler Kadi, then hidden behind a flower plot next to the house."
            },
            {
                "id": 8,
                "description": "This Mokoko Seed is located in the farm pen to the left, in front of a wagon holding hay."
            },
            {
                "id": 9,
                "description": "This Mokoko Seed is located in the farm pen to the right, in the middle of the sowed soil."
            }
        ]
    },
    {
        "id": 2,
        "label": "Loghill",
        "seeds": 9,
        "type": "Region",
        "map": "brilliantRidge.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is on the ground, near the burning blazer."
            }
        ]
    },
    {
        "id": 3,
        "label": "Toxiclaw Cavern",
        "seeds": 6,
        "type": "Dungeon",
        "map": "brilliantRidge.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is located on the ground near left of the path next to a broken down caravan."
            },
            {
                "id": 2,
                "description": "This seed is on the ground behind the large rock."
            },
            {
                "id": 3,
                "description": "This next seed is directly above from the last seed. You will see it on the ground in front of a boulder."
            },
            {
                "id": 4,
                "description": "This seed is located on the ground past the campfire and in front of the wooden rack holding hide."
            },
            {
                "id": 5,
                "description": "This Mokoko seed is located to the left of some paintings on the ground in some grass."
            },
            {
                "id": 6,
                "description": "The last Mokoko Seed can be found in some brush to the left of the path near the wooden stilt structure."
            }
        ]
    },
    {
        "id": 4,
        "label": "Ankumo Mountains",
        "seeds": 5,
        "type": "Region",
        "map": "ankumoMountain.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko seed is located against stone wall ruins between two pillars."
            },
            {
                "id": 2,
                "description": "This seed is located right of the swamp-like pond and in front of the burning blazer."
            },
            {
                "id": 3,
                "description": "This Mokoko Seed is located on the ground in plain sight, near a patch of grass but not hidden in it."
            },
            {
                "id": 4,
                "description": "This seed is located in the Border Watch camp to the right where the sick soldiers are. In the brush in the top left."
            },
            {
                "id": 5,
                "description": "The last Mokoko Seed is located behind the fence but in front of the watchtower. To get behind the fence, go towards the right side and you should be able to squeeze between the fence post and the rock."
            }
        ]
    },
    {
        "id": 5,
        "label": "Aquilok's Head",
        "seeds": 6,
        "type": "Dungeon",
        "map": "brilliantRidge.png",
        "instructions": [
            {
                "id": 1,
                "description": "There are two Mokoko Seeds at this location. You will see a lever to the left of the path. Activate it and you will see a boulder roll away and leave an opening. Jump down and stay to the right. You will need to fight the boss thats there and then to the right in front of a rock you will see the first seed in a patch of grass."
            },
            {
                "id": 2,
                "description": "Continuing on from the last seed, if you continue upwards you will come across a rock arch. Go under it and on the ground next to the cliff will be the second seed."
            },
            {
                "id": 3,
                "description": "This seed is located at the end of the path here, hidden in some grass on the ground."
            },
            {
                "id": 4,
                "description": "You will find this Mokoko Seed on the ground left of the path near some skeletal remains."
            },
            {
                "id": 5,
                "description": "The last two Mokoko Seeds are located here. After defeating the boss, go up and to the left and you will see a rock wall you can break. Once through, you will find another enemy to kill. The first seed is in the grass to the left."
            },
            {
                "id": 6,
                "description": "Contuining on from the last seed, this Mokoko Seed can be found in the grass to the right of the previous seed."
            }
        ]
    },
    {
        "id": 6,
        "label": "Rethramis Border",
        "seeds": 10,
        "type": "Region",
        "map": "rethramisBorder.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first Mokoko Seed is located behind the wagon next to the windmill."
            },
            {
                "id": 2,
                "description": "This seed is located to the left of the campfire, hidden in the big bush in front of the tree."
            },
            {
                "id": 3,
                "description": "This seed is located to the right of the path near some plants."
            },
            {
                "id": 4,
                "description": "This Mokoko Seed is located on the ground to the right of the entrance into Regria Monastery."
            },
            {
                "id": 5,
                "description": "This seed is right next to the 4th seed, the previous one, in the same spot."
            },
            {
                "id": 6,
                "description": "There will be three total seeds at this location. To access it, you need to defeat enemies near the area, then you will see the glowing yellow circle indicating that you can climb the cliff. Continue north from where you climbed up, and you will find one seed toward the left near some trees. "
            },
            {
                "id": 7,
                "description": "Refering to seed 6, continue upwards and you will see another seed hidden in a patch of grass."
            },
            {
                "id": 8,
                "description": "This seed is right next to seed 7. Now you should have gotten the 3 seeds from this secret location."
            },
            {
                "id": 9,
                "description": "This seed is located up against a rocky  hillside on the left side of the path. Above the straw hut."
            },
            {
                "id": 10,
                "description": "The last Mokoko Seed is located behind the straw huts near the bare tree."
            }
        ]
    },
    {
        "id": 7,
        "label": "Aquilok's Tail",
        "seeds": 6,
        "type": "Dungeon",
        "map": "brilliantRidge.png",
        "instructions": [
            {
                "id": 1,
                "description": "The first two Mokoko Seeds are located at the end of this path into a cave. You will see skeletal ribs sticking out, you can walk right under it going through the wall. The first seed will be immediately on your right on the ground."
            },
            {
                "id": 2,
                "description": "Continuing from the last seed, this one is located a little further on the ground."
            },
            {
                "id": 3,
                "description": "Two more Mokoko Seeds can be found at this location. Once get up to the next level, take an immediate left and kill the boss you see. Down to the right near some abstract rock pillars, you will see the first seed hidden in some grass."
            },
            {
                "id": 4,
                "description": "Continuing on from the last seed, go to the upper left where you will find the second seed in a bush next to a boulder."
            },
            {
                "id": 5,
                "description": "You will find this seed behind some large eggs you are suppose to destroy for the quest. It is hidden in a bush near the crystals."
            },
            {
                "id": 6,
                "description": "The last Mokoko Seed is to the left of the map after you kill the final boss. It will be hidden in a bush under a rock ledge with some small crystals on it."
            }
        ]
    }
]